OpenFOAM-13/tutorials/multiphaseEuler/pipeBend/constant/initialDistribution.particles
(
    (1e-6 0)
    (1.21e-6 0)
    (1.463e-6 0.0001)
    (1.77e-6 0.0002)
    (2.142e-6 0.0004)
    (2.591e-6 0.0008)
    (3.134e-6 0.0015)
    (3.792e-6 0.0025)
    (4.587e-6 0.004)
    (5.549e-6 0.0062)
    (6.71e-6 0.0093)
    (8.12e-6 0.0137)
    (9.82e-6 0.0198)
    (11.88e-6 0.0279)
    (14.38e-6 0.0383)
    (17.39e-6 0.0512)
    (21.04e-6 0.0663)
    (25.45e-6 0.0829)
    (30.79e-6 0.0991)
    (37.24e-6 0.1121)
    (45.06e-6 0.1183)
    (54.51e-6 0.1141)
    (65.94e-6 0.0977)
    (79.77e-6 0.0712)
    (96.49e-6 0.0412)
    (116.7e-6 0.0170)
    (141.2e-6 0.004)
    (170.8e-6 0.0002)
    (206.7e-6 0)
    (250e-6 0)
);
